int/resources/objectRepo/xmlTemplates/opera/Channel/req_FetchChannelRateMapping.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/par/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:FetchChannelRateMappingRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:Criteria MaxFetchCount="?" PageNumber="?">
            <v91:HotelCodes>
               <v91:Code/>
            </v91:HotelCodes>
            <v91:BookingChannelCodes>
               <v91:Code/>
            </v91:BookingChannelCodes>
            <v91:RatePlanCodes>
               <v91:Code/>
            </v91:RatePlanCodes>
            <v91:ChannelRatePlanCodes>
               <v91:Code/>
            </v91:ChannelRatePlanCodes>
            <v91:RatePlanCategories>
               <v91:Code/>
            </v91:RatePlanCategories>
            <v91:ChannelRatePlanCategories>
               <v91:Code/>
            </v91:ChannelRatePlanCategories>
            <v91:IncludeUnmappedRatePlans/>
            <v91:OnlyUnmappedRatePlans/>
            <v91:IncludeInactiveMappings/>
            <v91:OnlyNegotiatedRates/>
         </v9:Criteria>
      </v9:FetchChannelRateMappingRQ>
   </soapenv:Body>
</soapenv:Envelope>